## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: .
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_instance.nginx[0] will be created
+   resource "aws_instance" "nginx" {
+       ami                                  = "ami-065efef2c739d613b"
+       arn                                  = (known after apply)
+       associate_public_ip_address          = (known after apply)
+       availability_zone                    = (known after apply)
+       cpu_core_count                       = (known after apply)
+       cpu_threads_per_core                 = (known after apply)
+       disable_api_termination              = (known after apply)
+       ebs_optimized                        = (known after apply)
+       get_password_data                    = false
+       host_id                              = (known after apply)
+       iam_instance_profile                 = (known after apply)
+       id                                   = (known after apply)
+       instance_initiated_shutdown_behavior = (known after apply)
+       instance_state                       = (known after apply)
+       instance_type                        = "t2.micro"
+       ipv6_address_count                   = (known after apply)
+       ipv6_addresses                       = (known after apply)
+       key_name                             = (known after apply)
+       monitoring                           = (known after apply)
+       outpost_arn                          = (known after apply)
+       password_data                        = (known after apply)
+       placement_group                      = (known after apply)
+       placement_partition_number           = (known after apply)
+       primary_network_interface_id         = (known after apply)
+       private_dns                          = (known after apply)
+       private_ip                           = (known after apply)
+       public_dns                           = (known after apply)
+       public_ip                            = (known after apply)
+       secondary_private_ips                = (known after apply)
+       security_groups                      = (known after apply)
+       source_dest_check                    = true
+       subnet_id                            = (known after apply)
+       tags                                 = {
+           "Name"        = "jerin-default-web-0"
+           "environment" = "default"
+           "project"     = "terrateam"
+           "web_name"    = "resume"
        }
+       tags_all                             = {
+           "Name"        = "jerin-default-web-0"
+           "environment" = "default"
+           "project"     = "terrateam"
+           "web_name"    = "resume"
        }
+       tenancy                              = (known after apply)
+       user_data                            = (known after apply)
+       user_data_base64                     = (known after apply)
+       vpc_security_group_ids               = (known after apply)

+       capacity_reservation_specification {
+           capacity_reservation_preference = (known after apply)

+           capacity_reservation_target {
+               capacity_reservation_id = (known after apply)
            }
        }

+       ebs_block_device {
+           delete_on_termination = (known after apply)
+           device_name           = (known after apply)
+           encrypted             = (known after apply)
+           iops                  = (known after apply)
+           kms_key_id            = (known after apply)
+           snapshot_id           = (known after apply)
+           tags                  = (known after apply)
+           throughput            = (known after apply)
+           volume_id             = (known after apply)
+           volume_size           = (known after apply)
+           volume_type           = (known after apply)
        }

+       enclave_options {
+           enabled = (known after apply)
        }

+       ephemeral_block_device {
+           device_name  = (known after apply)
+           no_device    = (known after apply)
+           virtual_name = (known after apply)
        }

+       metadata_options {
+           http_endpoint               = (known after apply)
+           http_put_response_hop_limit = (known after apply)
+           http_tokens                 = (known after apply)
+           instance_metadata_tags      = (known after apply)
        }

+       network_interface {
+           delete_on_termination = (known after apply)
+           device_index          = (known after apply)
+           network_interface_id  = (known after apply)
        }

+       root_block_device {
+           delete_on_termination = (known after apply)
+           device_name           = (known after apply)
+           encrypted             = (known after apply)
+           iops                  = (known after apply)
+           kms_key_id            = (known after apply)
+           tags                  = (known after apply)
+           throughput            = (known after apply)
+           volume_id             = (known after apply)
+           volume_size           = (known after apply)
+           volume_type           = (known after apply)
        }
    }

  # aws_instance.nginx[1] will be created
+   resource "aws_instance" "nginx" {
+       ami                                  = "ami-065efef2c739d613b"
+       arn                                  = (known after apply)
+       associate_public_ip_address          = (known after apply)
+       availability_zone                    = (known after apply)
+       cpu_core_count                       = (known after apply)
+       cpu_threads_per_core                 = (known after apply)
+       disable_api_termination              = (known after apply)
+       ebs_optimized                        = (known after apply)
+       get_password_data                    = false
+       host_id                              = (known after apply)
+       iam_instance_profile                 = (known after apply)
+       id                                   = (known after apply)
+       instance_initiated_shutdown_behavior = (known after apply)
+       instance_state                       = (known after apply)
+       instance_type                        = "t2.micro"
+       ipv6_address_count                   = (known after apply)
+       ipv6_addresses                       = (known after apply)
+       key_name                             = (known after apply)
+       monitoring                           = (known after apply)
+       outpost_arn                          = (known after apply)
+       password_data                        = (known after apply)
+       placement_group                      = (known after apply)
+       placement_partition_number           = (known after apply)
+       primary_network_interface_id         = (known after apply)
+       private_dns                          = (known after apply)
+       private_ip                           = (known after apply)
+       public_dns                           = (known after apply)
+       public_ip                            = (known after apply)
+       secondary_private_ips                = (known after apply)
+       security_groups                      = (known after apply)
+       source_dest_check                    = true
+       subnet_id                            = (known after apply)
+       tags                                 = {
+           "Name"        = "jerin-default-web-1"
+           "environment" = "default"
+           "project"     = "terrateam"
+           "web_name"    = "resume"
        }
+       tags_all                             = {
+           "Name"        = "jerin-default-web-1"
+           "environment" = "default"
+           "project"     = "terrateam"
+           "web_name"    = "resume"
        }
+       tenancy                              = (known after apply)
+       user_data                            = (known after apply)
+       user_data_base64                     = (known after apply)
+       vpc_security_group_ids               = (known after apply)

+       capacity_reservation_specification {
+           capacity_reservation_preference = (known after apply)

+           capacity_reservation_target {
+               capacity_reservation_id = (known after apply)
            }
        }

+       ebs_block_device {
+           delete_on_termination = (known after apply)
+           device_name           = (known after apply)
+           encrypted             = (known after apply)
+           iops                  = (known after apply)
+           kms_key_id            = (known after apply)
+           snapshot_id           = (known after apply)
+           tags                  = (known after apply)
+           throughput            = (known after apply)
+           volume_id             = (known after apply)
+           volume_size           = (known after apply)
+           volume_type           = (known after apply)
        }

+       enclave_options {
+           enabled = (known after apply)
        }

+       ephemeral_block_device {
+           device_name  = (known after apply)
+           no_device    = (known after apply)
+           virtual_name = (known after apply)
        }

+       metadata_options {
+           http_endpoint               = (known after apply)
+           http_put_response_hop_limit = (known after apply)
+           http_tokens                 = (known after apply)
+           instance_metadata_tags      = (known after apply)
        }

+       network_interface {
+           delete_on_termination = (known after apply)
+           device_index          = (known after apply)
+           network_interface_id  = (known after apply)
        }

+       root_block_device {
+           delete_on_termination = (known after apply)
+           device_name           = (known after apply)
+           encrypted             = (known after apply)
+           iops                  = (known after apply)
+           kms_key_id            = (known after apply)
+           tags                  = (known after apply)
+           throughput            = (known after apply)
+           volume_id             = (known after apply)
+           volume_size           = (known after apply)
+           volume_type           = (known after apply)
        }
    }

  # aws_lb.nginx will be created
+   resource "aws_lb" "nginx" {
+       arn                        = (known after apply)
+       arn_suffix                 = (known after apply)
+       desync_mitigation_mode     = "defensive"
+       dns_name                   = (known after apply)
+       drop_invalid_header_fields = false
+       enable_deletion_protection = false
+       enable_http2               = true
+       enable_waf_fail_open       = false
+       id                         = (known after apply)
+       idle_timeout               = 60
+       internal                   = false
+       ip_address_type            = (known after apply)
+       load_balancer_type         = "application"
+       name                       = "jerin"
+       security_groups            = (known after apply)
+       subnets                    = (known after apply)
+       tags                       = {
+           "Name"        = "jerin-default-web-lb"
+           "environment" = "default"
+           "project"     = "terrateam"
+           "web_name"    = "resume"
        }
+       tags_all                   = {
+           "Name"        = "jerin-default-web-lb"
+           "environment" = "default"
+           "project"     = "terrateam"
+           "web_name"    = "resume"
        }
+       vpc_id                     = (known after apply)
+       zone_id                    = (known after apply)

+       access_logs {
+           bucket  = (known after apply)
+           enabled = true
+           prefix  = "alb-logs"
        }

+       subnet_mapping {
+           allocation_id        = (known after apply)
+           ipv6_address         = (known after apply)
+           outpost_id           = (known after apply)
+           private_ipv4_address = (known after apply)
+           subnet_id            = (known after apply)
        }
    }

  # aws_lb_listener.nginx will be created
+   resource "aws_lb_listener" "nginx" {
+       arn               = (known after apply)
+       id                = (known after apply)
+       load_balancer_arn = (known after apply)
+       port              = 80
+       protocol          = "HTTP"
+       ssl_policy        = (known after apply)
+       tags              = {
+           "Name"        = "jerin-default-lb-listener"
+           "environment" = "default"
+           "project"     = "terrateam"
+           "web_name"    = "resume"
        }
+       tags_all          = {
+           "Name"        = "jerin-default-lb-listener"
+           "environment" = "default"
+           "project"     = "terrateam"
+           "web_name"    = "resume"
        }

+       default_action {
+           order            = (known after apply)
+           target_group_arn = (known after apply)
+           type             = "forward"
        }
    }

  # aws_lb_target_group.nginx will be created
+   resource "aws_lb_target_group" "nginx" {
+       arn                                = (known after apply)
+       arn_suffix                         = (known after apply)
+       connection_termination             = false
+       deregistration_delay               = "300"
+       id                                 = (known after apply)
+       lambda_multi_value_headers_enabled = false
+       load_balancing_algorithm_type      = (known after apply)
+       name                               = (known after apply)
+       port                               = 80
+       preserve_client_ip                 = (known after apply)
+       protocol                           = "HTTP"
+       protocol_version                   = (known after apply)
+       proxy_protocol_v2                  = false
+       slow_start                         = 0
+       tags                               = {
+           "Name"        = "jerin-default-lb-tg"
+           "environment" = "default"
+           "project"     = "terrateam"
+           "web_name"    = "resume"
        }
+       tags_all                           = {
+           "Name"        = "jerin-default-lb-tg"
+           "environment" = "default"
+           "project"     = "terrateam"
+           "web_name"    = "resume"
        }
+       target_type                        = "instance"
+       vpc_id                             = (known after apply)

+       health_check {
+           enabled             = (known after apply)
+           healthy_threshold   = (known after apply)
+           interval            = (known after apply)
+           matcher             = (known after apply)
+           path                = (known after apply)
+           port                = (known after apply)
+           protocol            = (known after apply)
+           timeout             = (known after apply)
+           unhealthy_threshold = (known after apply)
        }

+       stickiness {
+           cookie_duration = (known after apply)
+           cookie_name     = (known after apply)
+           enabled         = (known after apply)
+           type            = (known after apply)
        }
    }

  # aws_lb_target_group_attachment.nginx[0] will be created
+   resource "aws_lb_target_group_attachment" "nginx" {
+       id               = (known after apply)
+       port             = 80
+       target_group_arn = (known after apply)
+       target_id        = (known after apply)
    }

  # aws_lb_target_group_attachment.nginx[1] will be created
+   resource "aws_lb_target_group_attachment" "nginx" {
+       id               = (known after apply)
+       port             = 80
+       target_group_arn = (known after apply)
+       target_id        = (known after apply)
    }

  # aws_s3_bucket_object.object["photo"] will be created
+   resource "aws_s3_bucket_object" "object" {
+       acl                    = "private"
+       bucket                 = (known after apply)
+       bucket_key_enabled     = (known after apply)
+       content_type           = (known after apply)
+       etag                   = (known after apply)
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "/website/Polish_20220517_223858461.png"
+       kms_key_id             = (known after apply)
+       server_side_encryption = (known after apply)
+       source                 = "./website/Polish_20220517_223858461.png"
+       storage_class          = (known after apply)
+       tags                   = {
+           "environment" = "default"
+           "project"     = "terrateam"
+           "web_name"    = "resume"
        }
+       tags_all               = {
+           "environment" = "default"
+           "project"     = "terrateam"
+           "web_name"    = "resume"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_bucket_object.object["website"] will be created
+   resource "aws_s3_bucket_object" "object" {
+       acl                    = "private"
+       bucket                 = (known after apply)
+       bucket_key_enabled     = (known after apply)
+       content_type           = (known after apply)
+       etag                   = (known after apply)
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "/website/index.html"
+       kms_key_id             = (known after apply)
+       server_side_encryption = (known after apply)
+       source                 = "./website/index.html"
+       storage_class          = (known after apply)
+       tags                   = {
+           "environment" = "default"
+           "project"     = "terrateam"
+           "web_name"    = "resume"
        }
+       tags_all               = {
+           "environment" = "default"
+           "project"     = "terrateam"
+           "web_name"    = "resume"
        }
+       version_id             = (known after apply)
    }

  # aws_security_group.alb_sg will be created
+   resource "aws_security_group" "alb_sg" {
+       arn                    = (known after apply)
+       description            = "Managed by Terraform"
+       egress                 = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               description      = ""
+               from_port        = 0
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "-1"
+               security_groups  = []
+               self             = false
+               to_port          = 0
            },
        ]
+       id                     = (known after apply)
+       ingress                = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               description      = ""
+               from_port        = 80
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 80
            },
        ]
+       name                   = (known after apply)
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Name"        = "jerin-default-alb-sg"
+           "environment" = "default"
+           "project"     = "terrateam"
+           "web_name"    = "resume"
        }
+       tags_all               = {
+           "Name"        = "jerin-default-alb-sg"
+           "environment" = "default"
+           "project"     = "terrateam"
+           "web_name"    = "resume"
        }
+       vpc_id                 = (known after apply)
    }

  # aws_security_group.nginx_sg will be created
+   resource "aws_security_group" "nginx_sg" {
+       arn                    = (known after apply)
+       description            = "Managed by Terraform"
+       egress                 = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               description      = ""
+               from_port        = 0
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "-1"
+               security_groups  = []
+               self             = false
+               to_port          = 0
            },
        ]
+       id                     = (known after apply)
+       ingress                = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               description      = ""
+               from_port        = 80
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 80
            },
        ]
+       name                   = (known after apply)
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Name"        = "jerin-default-web-sg"
+           "environment" = "default"
+           "project"     = "terrateam"
+           "web_name"    = "resume"
        }
+       tags_all               = {
+           "Name"        = "jerin-default-web-sg"
+           "environment" = "default"
+           "project"     = "terrateam"
+           "web_name"    = "resume"
        }
+       vpc_id                 = (known after apply)
    }

  # random_integer.rand will be created
+   resource "random_integer" "rand" {
+       id     = (known after apply)
+       max    = 99999
+       min    = 20000
+       result = (known after apply)
    }

  # module.vpc.aws_internet_gateway.this[0] will be created
+   resource "aws_internet_gateway" "this" {
+       arn      = (known after apply)
+       id       = (known after apply)
+       owner_id = (known after apply)
+       tags     = {
+           "Name"        = "jerin-default-vpc"
+           "environment" = "default"
+           "project"     = "terrateam"
+           "web_name"    = "resume"
        }
+       tags_all = {
+           "Name"        = "jerin-default-vpc"
+           "environment" = "default"
+           "project"     = "terrateam"
+           "web_name"    = "resume"
        }
+       vpc_id   = (known after apply)
    }

  # module.vpc.aws_route.public_internet_gateway[0] will be created
+   resource "aws_route" "public_internet_gateway" {
+       destination_cidr_block = "0.0.0.0/0"
+       gateway_id             = (known after apply)
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)

+       timeouts {
+           create = "5m"
        }
    }

  # module.vpc.aws_route_table.public[0] will be created
+   resource "aws_route_table" "public" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = (known after apply)
+       tags             = {
+           "Name"        = "jerin-default-vpc"
+           "environment" = "default"
+           "project"     = "terrateam"
+           "web_name"    = "resume"
        }
+       tags_all         = {
+           "Name"        = "jerin-default-vpc"
+           "environment" = "default"
+           "project"     = "terrateam"
+           "web_name"    = "resume"
        }
+       vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
+   resource "aws_route_table_association" "public" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
+   resource "aws_route_table_association" "public" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.public[0] will be created
+   resource "aws_subnet" "public" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.0.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = true
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name"        = "jerin-default-vpc"
+           "environment" = "default"
+           "project"     = "terrateam"
+           "web_name"    = "resume"
        }
+       tags_all                                       = {
+           "Name"        = "jerin-default-vpc"
+           "environment" = "default"
+           "project"     = "terrateam"
+           "web_name"    = "resume"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[1] will be created
+   resource "aws_subnet" "public" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1b"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.1.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = true
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name"        = "jerin-default-vpc"
+           "environment" = "default"
+           "project"     = "terrateam"
+           "web_name"    = "resume"
        }
+       tags_all                                       = {
+           "Name"        = "jerin-default-vpc"
+           "environment" = "default"
+           "project"     = "terrateam"
+           "web_name"    = "resume"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.this[0] will be created
+   resource "aws_vpc" "this" {
+       arn                                  = (known after apply)
+       assign_generated_ipv6_cidr_block     = false
+       cidr_block                           = "10.0.0.0/16"
+       default_network_acl_id               = (known after apply)
+       default_route_table_id               = (known after apply)
+       default_security_group_id            = (known after apply)
+       dhcp_options_id                      = (known after apply)
+       enable_classiclink                   = (known after apply)
+       enable_classiclink_dns_support       = (known after apply)
+       enable_dns_hostnames                 = false
+       enable_dns_support                   = true
+       id                                   = (known after apply)
+       instance_tenancy                     = "default"
+       ipv6_association_id                  = (known after apply)
+       ipv6_cidr_block                      = (known after apply)
+       ipv6_cidr_block_network_border_group = (known after apply)
+       main_route_table_id                  = (known after apply)
+       owner_id                             = (known after apply)
+       tags                                 = {
+           "Name"        = "jerin-default-vpc"
+           "environment" = "default"
+           "project"     = "terrateam"
+           "web_name"    = "resume"
        }
+       tags_all                             = {
+           "Name"        = "jerin-default-vpc"
+           "environment" = "default"
+           "project"     = "terrateam"
+           "web_name"    = "resume"
        }
    }

  # module.web_app_s3.aws_iam_instance_profile.instance_profile will be created
+   resource "aws_iam_instance_profile" "instance_profile" {
+       arn         = (known after apply)
+       create_date = (known after apply)
+       id          = (known after apply)
+       name        = (known after apply)
+       path        = "/"
+       role        = (known after apply)
+       tags_all    = (known after apply)
+       unique_id   = (known after apply)
    }

  # module.web_app_s3.aws_iam_role.allow_nginx_s3 will be created
+   resource "aws_iam_role" "allow_nginx_s3" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "ec2.amazonaws.com"
                        }
+                       Sid       = ""
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = (known after apply)
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags                  = {
+           "environment" = "default"
+           "project"     = "terrateam"
+           "web_name"    = "resume"
        }
+       tags_all              = {
+           "environment" = "default"
+           "project"     = "terrateam"
+           "web_name"    = "resume"
        }
+       unique_id             = (known after apply)

+       inline_policy {
+           name   = (known after apply)
+           policy = (known after apply)
        }
    }

  # module.web_app_s3.aws_iam_role_policy.nginx_policy will be created
+   resource "aws_iam_role_policy" "nginx_policy" {
+       id     = (known after apply)
+       name   = "jerin-nginx-s3-policy"
+       policy = (known after apply)
+       role   = (known after apply)
    }

  # module.web_app_s3.aws_s3_bucket.web_bucket will be created
+   resource "aws_s3_bucket" "web_bucket" {
+       acceleration_status         = (known after apply)
+       acl                         = "private"
+       arn                         = (known after apply)
+       bucket                      = (known after apply)
+       bucket_domain_name          = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = true
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       object_lock_enabled         = (known after apply)
+       policy                      = (known after apply)
+       region                      = (known after apply)
+       request_payer               = (known after apply)
+       tags                        = {
+           "environment" = "default"
+           "project"     = "terrateam"
+           "web_name"    = "resume"
        }
+       tags_all                    = {
+           "environment" = "default"
+           "project"     = "terrateam"
+           "web_name"    = "resume"
        }
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)

+       object_lock_configuration {
+           object_lock_enabled = (known after apply)

+           rule {
+               default_retention {
+                   days  = (known after apply)
+                   mode  = (known after apply)
+                   years = (known after apply)
                }
            }
        }

+       versioning {
+           enabled    = (known after apply)
+           mfa_delete = (known after apply)
        }
    }

Plan: 24 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   loadbalancer_dns = (known after apply)

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:. workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 17.74 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| . | default | 17.23 | 34.96 | 17.74|
| | **Total** | **17.23** | **34.96** | **17.74** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
